import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-root',
  templateUrl: './app.component.html',
  styleUrls: ['./app.component.css']
})
export class AppComponent implements OnInit {
  title = 'app works!';
  menuData = [
    {
      label: 1, icon: 'fa-user', children: [

        {
          label: 'a',

          children: [
            {
              label: '哈好'
            },
            {
              label: '回电话'
            }
          ]
        },

        {
          label: '哈好'
        },
        {
          label: '回电话'
        },
        {
          label: 'c'
        },
        {
          label: 'b'
        },
        {
          label: 'c'
        },
        {
          label: 'b'
        },
        {
          label: 'c'
        },
        {
          label: 'b'
        },
        {
          label: 'c'
        },
        {
          label: 'b'
        },
        {
          label: 'c'
        },
        {
          label: 'b'
        },
        {
          label: 'c'
        }
      ]
    },
    {
      label: 2, children: [
        {
          label: '哈好'
        },
        {
          label: '回电话'
        }
      ]
    },
    {
      label: 2, children: [
        {
          label: '哈好'
        },
        {
          label: '回电话'
        }
      ]
    },
    {
      label: 2, children: [
        {
          label: '哈好'
        },
        {
          label: '回电话'
        }
      ]
    },
    {
      label: 2, children: [
        {
          label: '哈好'
        },
        {
          label: '回电话'
        }
      ]
    },
    {
      label: 2, children: [
        {
          label: '哈好'
        },
        {
          label: '回电话'
        }
      ]
    },
    {
      label: 2, children: [
        {
          label: '哈好'
        },
        {
          label: '回电话'
        }
      ]
    },
    {
      label: 2, children: [
        {
          label: '哈好'
        },
        {
          label: '回电话'
        }
      ]
    }, {
      label: 2, children: [
        {
          label: '哈好'
        },
        {
          label: '回电话'
        }
      ]
    },
    {
      label: 2, children: [
        {
          label: '哈好'
        },
        {
          label: '回电话'
        }
      ]
    },

    {
      label: 2, children: [
        {
          label: '哈好'
        },
        {
          label: '回电话'
        }
      ]
    }, {
      label: 2, children: [
        {
          label: '哈好'
        },
        {
          label: '回电话'
        }
      ]
    },
    {
      label: 'b'
    },
    {
      label: 'c'
    },
    {
      label: 'b'
    },
    {
      label: 'c'
    },
    {
      label: 'b'
    },
    {
      label: 'c'
    },
    {
      label: 'b'
    },
    {
      label: 'b'
    },
    {
      label: 'c'
    },
    {
      label: 'b'
    },
    {
      label: 'c'
    },
    {
      label: 'b'
    },
    {
      label: 'c'
    },
    {
      label: 'b'
    },
    {
      label: 'b'
    },
    {
      label: 'c'
    },
    {
      label: 'b'
    },
    {
      label: 'c'
    },
    {
      label: 'b'
    },
    {
      label: 'c'
    },
    {
      label: 'b'
    },
    {
      label: 'b'
    },
    {
      label: 'c'
    },
    {
      label: 'b'
    },
    {
      label: 'c'
    },
    {
      label: 'b'
    },
    {
      label: 'c'
    },
    {
      label: 'b'
    },
    {
      label: 'b'
    },
    {
      label: 'c'
    },
    {
      label: 'b'
    },
    {
      label: 'c'
    },
    {
      label: 'b'
    },
    {
      label: 'c'
    },
    {
      label: 'b'
    },
  ]
  cols = [
    "区域", "角度", "最小直径", "外凸点", "角度_o", "最大直接", "内凹点", "最大...", "直径差", "结果"
  ]

  data = [
    {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    }, {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    }, {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "3610°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "3610°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "3610°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "3610°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    }, {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    }, {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    }, {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    },
    {
      "区域": "360°", "角度": 214.6, "最小直径": 1243.19, "外凸点": "1.63", "角度_o": 224.60, "最大直接": 1247.09, "内凹点": -2.77, "最大...": '', "直径差": 3.02, "结果": ''
    }
  ];

  edata = [];

  mdata = [
    {status:'error',count:2,message:"机器运行故障"},
    {status:'info',count:2,message:"单纯的消息单纯的消息单纯的消息单纯的消息单纯的消息单纯的消息"},
    {status:'success',count:2,message:"成功的消息"},
    {status:'warn',count:2,message:"警告,水位过低"},
  ]


  click(e) {
    console.log(e)
  }
  
  ngOnInit(){
    // setInterval(()=>{
    //   if(this.mdata.length){
    //     this.mdata = [];
    //   }else {
    //     this.mdata = [
    //       {status:'error',count:2,message:"机器运行故障"},
    //       {status:'info',count:2,message:"单纯的消息单纯的消息单纯的消息单纯的消息单纯的消息单纯的消息"},
    //       {status:'success',count:2,message:"成功的消息"},
    //       {status:'warn',count:2,message:"警告,水位过低"},
    //     ]
    //   }
    // },3000)
  }

}
